#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/bcgov/xgr00q-dev-sso-requests/runs/run-XBz7RNY16eUtWNqp

Waiting for the plan to start...

Terraform v1.0.1
on linux_amd64
Initializing plugins and modules...
random_password.db_password: Refreshing state... [id=none]
module.db.random_id.snapshot_identifier[0]: Refreshing state... [id=AMzs6g]
aws_api_gateway_rest_api.sso_backend: Refreshing state... [id=gcp9dahm4c]
module.s3_sso_api_swagger.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.s3_keycloak_v2.aws_s3_bucket.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_cloudwatch_event_rule.scheduler: Refreshing state... [id=tf-apply-scheduler]
aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
aws_iam_role.api_gateway_s3_role: Refreshing state... [id=ApiGatewayAmazonS3AccessRole]
aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:ca-central-1:220881534007:certificate/399165e3-6c0b-4264-940c-3a960e4b86b0]
module.s3_sso_api_swagger.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-api-swagger,private]
module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-api-swagger]
module.db.aws_db_subnet_group.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_s3_object.swagger_dist["swagger-ui.css"]: Refreshing state... [id=swagger-ui.css]
aws_s3_object.swagger_dist["favicon-32x32.png"]: Refreshing state... [id=favicon-32x32.png]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"]: Refreshing state... [id=swagger-ui-standalone-preset.js.map]
aws_s3_object.swagger_dist["absolute-path.js"]: Refreshing state... [id=absolute-path.js]
aws_s3_object.swagger_dist["swagger-initializer.js"]: Refreshing state... [id=swagger-initializer.js]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"]: Refreshing state... [id=swagger-ui-es-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"]: Refreshing state... [id=swagger-ui-standalone-preset.js]
aws_s3_object.swagger_dist["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"]: Refreshing state... [id=swagger-ui-bundle.js.map]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"]: Refreshing state... [id=swagger-ui-es-bundle-core.js.map]
aws_s3_object.swagger_dist["NOTICE"]: Refreshing state... [id=NOTICE]
aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"]: Refreshing state... [id=swagger-ui-es-bundle.js]
aws_s3_object.swagger_dist["index.js"]: Refreshing state... [id=index.js]
aws_s3_object.swagger_dist["swagger-ui.css.map"]: Refreshing state... [id=swagger-ui.css.map]
aws_s3_object.swagger_dist["favicon-16x16.png"]: Refreshing state... [id=favicon-16x16.png]
aws_s3_object.swagger_dist["swagger-ui.js"]: Refreshing state... [id=swagger-ui.js]
aws_s3_object.swagger_dist["index.css"]: Refreshing state... [id=index.css]
aws_s3_object.swagger_dist["README.md"]: Refreshing state... [id=README.md]
aws_s3_object.swagger_dist["oauth2-redirect.html"]: Refreshing state... [id=oauth2-redirect.html]
aws_s3_object.swagger_dist["package.json"]: Refreshing state... [id=package.json]
aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"]: Refreshing state... [id=swagger-ui-es-bundle-core.js]
aws_s3_object.swagger_dist["swagger-ui.js.map"]: Refreshing state... [id=swagger-ui.js.map]
aws_s3_object.swagger_dist["swagger-output.json"]: Refreshing state... [id=swagger-output.json]
aws_s3_object.swagger_dist["swagger-ui-bundle.js"]: Refreshing state... [id=swagger-ui-bundle.js]
aws_s3_object.swagger_dist["LICENSE"]: Refreshing state... [id=LICENSE]
module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-api-swagger]
aws_api_gateway_resource.actions: Refreshing state... [id=i57f4h]
aws_api_gateway_resource.api: Refreshing state... [id=9jt82m]
aws_api_gateway_resource.openapi_swagger: Refreshing state... [id=8i8nrw]
aws_api_gateway_resource.app: Refreshing state... [id=l8dcc6]
aws_apigatewayv2_domain_name.this: Refreshing state... [id=api-dev.loginproxy.gov.bc.ca]
module.db.aws_security_group.this[0]: Refreshing state... [id=sg-064f9794b304dc7dd]
aws_security_group.rds_sg: Refreshing state... [id=sg-0dd30e1d7b3040e06]
module.s3_keycloak_v2.aws_s3_bucket_acl.this: Refreshing state... [id=xgr00q-dev-keycloak,private]
module.s3_keycloak_v2.aws_s3_bucket_cors_configuration.this: Refreshing state... [id=xgr00q-dev-keycloak]
module.s3_keycloak_v2.aws_s3_bucket_public_access_block.this: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_resource.api_proxy: Refreshing state... [id=uysksd]
module.s3_keycloak_v2.aws_s3_bucket_server_side_encryption_configuration.this[0]: Refreshing state... [id=xgr00q-dev-keycloak]
aws_api_gateway_resource.proxy: Refreshing state... [id=oly2td]
aws_api_gateway_resource.swagger_assets_proxy: Refreshing state... [id=a3pb6h]
aws_api_gateway_resource.actions_proxy: Refreshing state... [id=cmapde]
aws_api_gateway_resource.openapi_swagger_proxy: Refreshing state... [id=ja8avr]
aws_iam_role_policy_attachment.this: Refreshing state... [id=iam_for_lambda-20210817012201712900000001]
aws_lambda_function.scheduler: Refreshing state... [id=lambda-scheduler]
aws_api_gateway_method.proxy: Refreshing state... [id=agm-gcp9dahm4c-oly2td-ANY]
module.db.aws_rds_cluster.this[0]: Refreshing state... [id=aurora-db-postgres]
aws_api_gateway_method.api_proxy: Refreshing state... [id=agm-gcp9dahm4c-uysksd-ANY]
aws_api_gateway_method.swagger_assets_proxy: Refreshing state... [id=agm-gcp9dahm4c-a3pb6h-GET]
aws_api_gateway_method.actions_proxy: Refreshing state... [id=agm-gcp9dahm4c-cmapde-ANY]
aws_api_gateway_method.openapi_swagger_proxy: Refreshing state... [id=agm-gcp9dahm4c-ja8avr-GET]
aws_iam_role_policy.s3_read_access_policy: Refreshing state... [id=ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy]
aws_apigatewayv2_api_mapping.this: Refreshing state... [id=zfeccr]
aws_api_gateway_integration.openapi_swagger_assets: Refreshing state... [id=agi-gcp9dahm4c-a3pb6h-GET]
aws_api_gateway_method_response.swagger_assets_proxy: Refreshing state... [id=agmr-gcp9dahm4c-a3pb6h-GET-200]
aws_api_gateway_integration.openapi_swagger: Refreshing state... [id=agi-gcp9dahm4c-ja8avr-GET]
aws_api_gateway_method_response.openapi_swagger_proxy: Refreshing state... [id=agmr-gcp9dahm4c-ja8avr-GET-200]
aws_api_gateway_integration_response.openapi_swagger_assets: Refreshing state... [id=agir-gcp9dahm4c-a3pb6h-GET-200]
aws_api_gateway_integration_response.openapi_swagger: Refreshing state... [id=agir-gcp9dahm4c-ja8avr-GET-200]
aws_cloudwatch_event_target.scheduler: Refreshing state... [id=tf-apply-scheduler-scheduler]
aws_lambda_permission.scheduler: Refreshing state... [id=AllowExecutionFromCloudWatch]
module.db.aws_security_group_rule.default_ingress[0]: Refreshing state... [id=sgrule-4119090639]
aws_lambda_function.css_api: Refreshing state... [id=lambda-css-api]
aws_lambda_function.app: Refreshing state... [id=lambda-app]
aws_lambda_function.db: Refreshing state... [id=lambda-db]
aws_lambda_function.actions: Refreshing state... [id=lambda-actions]
aws_lambda_permission.apigw_api: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.api: Refreshing state... [id=agi-gcp9dahm4c-uysksd-ANY]
aws_api_gateway_integration.actions: Refreshing state... [id=agi-gcp9dahm4c-cmapde-ANY]
aws_lambda_permission.apigw_actions: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_lambda_permission.apigw_auth: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.lambda: Refreshing state... [id=agi-gcp9dahm4c-oly2td-ANY]
aws_api_gateway_deployment.this: Refreshing state... [id=uwe96d]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.s3_sso_api_swagger.aws_s3_bucket_acl.this has been deleted
  - resource "aws_s3_bucket_acl" "this" {
      - acl    = "private" -> null
      - bucket = "xgr00q-dev-api-swagger" -> null
      - id     = "xgr00q-dev-api-swagger,private" -> null

      - access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - id   = "d7084b6cdbeecec8affd83b240e6dd786616058e5491128e4f7afc21b1ea8a0d" -> null
                  - type = "CanonicalUser" -> null
                }
            }

          - owner {
              - id = "d7084b6cdbeecec8affd83b240e6dd786616058e5491128e4f7afc21b1ea8a0d" -> null
            }
        }
    }
  # module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this has been deleted
  - resource "aws_s3_bucket_cors_configuration" "this" {
      - bucket = "xgr00q-dev-api-swagger" -> null
      - id     = "xgr00q-dev-api-swagger" -> null

      - cors_rule {
          - allowed_headers = [
              - "*",
            ] -> null
          - allowed_methods = [
              - "PUT",
            ] -> null
          - allowed_origins = [
              - "*",
            ] -> null
          - expose_headers  = [
              - "ETag",
            ] -> null
          - max_age_seconds = 3000 -> null
        }
    }
  # module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this has been deleted
  - resource "aws_s3_bucket_public_access_block" "this" {
      - block_public_acls       = true -> null
      - block_public_policy     = true -> null
      - bucket                  = "xgr00q-dev-api-swagger" -> null
      - id                      = "xgr00q-dev-api-swagger" -> null
      - ignore_public_acls      = true -> null
      - restrict_public_buckets = true -> null
    }
  # module.s3_sso_api_swagger.aws_s3_bucket.this has been deleted
  - resource "aws_s3_bucket" "this" {
      - arn                         = "arn:aws:s3:::xgr00q-dev-api-swagger" -> null
      - bucket                      = "xgr00q-dev-api-swagger" -> null
      - bucket_domain_name          = "xgr00q-dev-api-swagger.s3.amazonaws.com" -> null
      - bucket_regional_domain_name = "xgr00q-dev-api-swagger.s3.ca-central-1.amazonaws.com" -> null
      - force_destroy               = false -> null
      - hosted_zone_id              = "Z1QDHH18159H29" -> null
      - id                          = "xgr00q-dev-api-swagger" -> null
      - object_lock_enabled         = false -> null
      - region                      = "ca-central-1" -> null
      - request_payer               = "BucketOwner" -> null
      - tags_all                    = {} -> null

      - grant {
          - id          = "d7084b6cdbeecec8affd83b240e6dd786616058e5491128e4f7afc21b1ea8a0d" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }

      - versioning {
          - enabled    = false -> null
          - mfa_delete = false -> null
        }
    }
  # aws_api_gateway_resource.openapi_swagger_proxy has been deleted
  - resource "aws_api_gateway_resource" "openapi_swagger_proxy" {
      - id          = "ja8avr" -> null
      - parent_id   = "8i8nrw" -> null
      - path        = "/openapi/swagger" -> null
      - path_part   = "swagger" -> null
      - rest_api_id = "gcp9dahm4c" -> null
    }
  # aws_api_gateway_integration.openapi_swagger has been deleted
  - resource "aws_api_gateway_integration" "openapi_swagger" {
      - cache_namespace         = "ja8avr" -> null
      - connection_type         = "INTERNET" -> null
      - credentials             = "arn:aws:iam::220881534007:role/ApiGatewayAmazonS3AccessRole" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-gcp9dahm4c-ja8avr-GET" -> null
      - integration_http_method = "GET" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {
          - "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          - "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
        } -> null
      - resource_id             = "ja8avr" -> null
      - rest_api_id             = "gcp9dahm4c" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS" -> null
      - uri                     = "arn:aws:apigateway:ca-central-1:s3:path/xgr00q-dev-api-swagger/index.html" -> null
    }
  # aws_iam_role.api_gateway_s3_role has been changed
  ~ resource "aws_iam_role" "api_gateway_s3_role" {
        id                    = "ApiGatewayAmazonS3AccessRole"
        name                  = "ApiGatewayAmazonS3AccessRole"
      + tags                  = {}
        # (9 unchanged attributes hidden)

      + inline_policy {
          + name   = "AWSS3ResourceReadAccessRolePolicy"
          + policy = jsonencode(
                {
                  + Statement = [
                      + {
                          + Action   = [
                              + "s3:Get*",
                              + "s3:List*",
                              + "s3-object-lambda:Get*",
                              + "s3-object-lambda:List*",
                            ]
                          + Effect   = "Allow"
                          + Resource = [
                              + "arn:aws:s3:::xgr00q-dev-api-swagger/*",
                            ]
                        },
                    ]
                  + Version   = "2012-10-17"
                }
            )
        }
    }
  # aws_api_gateway_resource.openapi_swagger has been deleted
  - resource "aws_api_gateway_resource" "openapi_swagger" {
      - id          = "8i8nrw" -> null
      - parent_id   = "irntllxe14" -> null
      - path        = "/openapi" -> null
      - path_part   = "openapi" -> null
      - rest_api_id = "gcp9dahm4c" -> null
    }
  # aws_api_gateway_method.swagger_assets_proxy has been deleted
  - resource "aws_api_gateway_method" "swagger_assets_proxy" {
      - api_key_required   = false -> null
      - authorization      = "NONE" -> null
      - http_method        = "GET" -> null
      - id                 = "agm-gcp9dahm4c-a3pb6h-GET" -> null
      - request_parameters = {
          - "method.request.header.Content-Disposition" = true
          - "method.request.header.Content-Type"        = true
          - "method.request.path.asset"                 = true
        } -> null
      - resource_id        = "a3pb6h" -> null
      - rest_api_id        = "gcp9dahm4c" -> null
    }
  # aws_api_gateway_method_response.openapi_swagger_proxy has been deleted
  - resource "aws_api_gateway_method_response" "openapi_swagger_proxy" {
      - http_method         = "GET" -> null
      - id                  = "agmr-gcp9dahm4c-ja8avr-GET-200" -> null
      - resource_id         = "ja8avr" -> null
      - response_parameters = {
          - "method.response.header.Content-Disposition" = true
          - "method.response.header.Content-Type"        = true
        } -> null
      - rest_api_id         = "gcp9dahm4c" -> null
      - status_code         = "200" -> null
    }
  # aws_api_gateway_integration_response.openapi_swagger_assets has been deleted
  - resource "aws_api_gateway_integration_response" "openapi_swagger_assets" {
      - http_method         = "GET" -> null
      - id                  = "agir-gcp9dahm4c-a3pb6h-GET-200" -> null
      - resource_id         = "a3pb6h" -> null
      - response_parameters = {
          - "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          - "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        } -> null
      - rest_api_id         = "gcp9dahm4c" -> null
      - status_code         = "200" -> null
    }
  # aws_api_gateway_method.openapi_swagger_proxy has been deleted
  - resource "aws_api_gateway_method" "openapi_swagger_proxy" {
      - api_key_required   = false -> null
      - authorization      = "NONE" -> null
      - http_method        = "GET" -> null
      - id                 = "agm-gcp9dahm4c-ja8avr-GET" -> null
      - request_parameters = {
          - "method.request.header.Content-Disposition" = true
          - "method.request.header.Content-Type"        = true
        } -> null
      - resource_id        = "ja8avr" -> null
      - rest_api_id        = "gcp9dahm4c" -> null
    }
  # aws_api_gateway_resource.swagger_assets_proxy has been deleted
  - resource "aws_api_gateway_resource" "swagger_assets_proxy" {
      - id          = "a3pb6h" -> null
      - parent_id   = "8i8nrw" -> null
      - path        = "/openapi/{asset}" -> null
      - path_part   = "{asset}" -> null
      - rest_api_id = "gcp9dahm4c" -> null
    }
  # aws_api_gateway_method_response.swagger_assets_proxy has been deleted
  - resource "aws_api_gateway_method_response" "swagger_assets_proxy" {
      - http_method         = "GET" -> null
      - id                  = "agmr-gcp9dahm4c-a3pb6h-GET-200" -> null
      - resource_id         = "a3pb6h" -> null
      - response_parameters = {
          - "method.response.header.Content-Disposition" = true
          - "method.response.header.Content-Type"        = true
        } -> null
      - rest_api_id         = "gcp9dahm4c" -> null
      - status_code         = "200" -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "8e0e2470d0530680f6f16c7817337891" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-standalone-preset.js" -> null
      - key                = "swagger-ui-standalone-preset.js" -> null
      - source             = "swagger-ui-dist/swagger-ui-standalone-preset.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui.js.map"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "08b9c55fb78edc1945a01a79b053d8ee" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui.js.map" -> null
      - key                = "swagger-ui.js.map" -> null
      - source             = "swagger-ui-dist/swagger-ui.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["index.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "4843f77ccf9e12e7e60efa279baaffb3" -> null
      - force_destroy      = false -> null
      - id                 = "index.js" -> null
      - key                = "index.js" -> null
      - source             = "swagger-ui-dist/index.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["LICENSE"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "3b83ef96387f14655fc854ddc3c6bd57" -> null
      - force_destroy      = false -> null
      - id                 = "LICENSE" -> null
      - key                = "LICENSE" -> null
      - source             = "swagger-ui-dist/LICENSE" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["favicon-32x32.png"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "40d4f2c38d1cd854ad463f16373cbcb6" -> null
      - force_destroy      = false -> null
      - id                 = "favicon-32x32.png" -> null
      - key                = "favicon-32x32.png" -> null
      - source             = "swagger-ui-dist/favicon-32x32.png" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "6405e42f91756697fa77db303cbaddef" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-es-bundle.js.map" -> null
      - key                = "swagger-ui-es-bundle.js.map" -> null
      - source             = "swagger-ui-dist/swagger-ui-es-bundle.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["index.html"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "c435050a755f3ba71a4df97e599b71c9" -> null
      - force_destroy      = false -> null
      - id                 = "index.html" -> null
      - key                = "index.html" -> null
      - source             = "swagger-ui-dist/index.html" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-output.json"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "d10a662b954f461bac391dc4bf18b5ad" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-output.json" -> null
      - key                = "swagger-output.json" -> null
      - source             = "swagger-ui-dist/swagger-output.json" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-initializer.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "1e0aac5572865132f120e6675d27dae0" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-initializer.js" -> null
      - key                = "swagger-initializer.js" -> null
      - source             = "swagger-ui-dist/swagger-initializer.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["index.css"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "54fdd628e48969ad325a0b370af12f53" -> null
      - force_destroy      = false -> null
      - id                 = "index.css" -> null
      - key                = "index.css" -> null
      - source             = "swagger-ui-dist/index.css" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-bundle.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "e0ae76d9795806abae1f7781d89d4f4b" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-bundle.js" -> null
      - key                = "swagger-ui-bundle.js" -> null
      - source             = "swagger-ui-dist/swagger-ui-bundle.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "4ed1de27405e80c1120ff81e2f3db61b" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-es-bundle-core.js.map" -> null
      - key                = "swagger-ui-es-bundle-core.js.map" -> null
      - source             = "swagger-ui-dist/swagger-ui-es-bundle-core.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "283ed240f92b4b56d8482b5f1e519274" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-es-bundle.js" -> null
      - key                = "swagger-ui-es-bundle.js" -> null
      - source             = "swagger-ui-dist/swagger-ui-es-bundle.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["absolute-path.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "7ca5ebff3b35e49ef75f96885c6ed7c2" -> null
      - force_destroy      = false -> null
      - id                 = "absolute-path.js" -> null
      - key                = "absolute-path.js" -> null
      - source             = "swagger-ui-dist/absolute-path.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "c0fb1a3c06697d061e9caeb5a6fab66c" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-standalone-preset.js.map" -> null
      - key                = "swagger-ui-standalone-preset.js.map" -> null
      - source             = "swagger-ui-dist/swagger-ui-standalone-preset.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui.css"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "d6de32fafed0ea75ef760baa8ebe2bda" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui.css" -> null
      - key                = "swagger-ui.css" -> null
      - source             = "swagger-ui-dist/swagger-ui.css" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "b549c47d456f47d5c1cc21fb245266a6" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-bundle.js.map" -> null
      - key                = "swagger-ui-bundle.js.map" -> null
      - source             = "swagger-ui-dist/swagger-ui-bundle.js.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["favicon-16x16.png"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "f0ae831196d55d8f4115b6c5e8ec5384" -> null
      - force_destroy      = false -> null
      - id                 = "favicon-16x16.png" -> null
      - key                = "favicon-16x16.png" -> null
      - source             = "swagger-ui-dist/favicon-16x16.png" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "35392619ad8e01c979705c4506f0af86" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui.js" -> null
      - key                = "swagger-ui.js" -> null
      - source             = "swagger-ui-dist/swagger-ui.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui.css.map"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "51d42b332ad7cdcf5fbb5820308e54db" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui.css.map" -> null
      - key                = "swagger-ui.css.map" -> null
      - source             = "swagger-ui-dist/swagger-ui.css.map" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["NOTICE"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "342625133694cfa71ee5eb6126af5825" -> null
      - force_destroy      = false -> null
      - id                 = "NOTICE" -> null
      - key                = "NOTICE" -> null
      - source             = "swagger-ui-dist/NOTICE" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["oauth2-redirect.html"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "3ab4f43d18d78a61dde617b747479e96" -> null
      - force_destroy      = false -> null
      - id                 = "oauth2-redirect.html" -> null
      - key                = "oauth2-redirect.html" -> null
      - source             = "swagger-ui-dist/oauth2-redirect.html" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "0bdf99b84564bfe12569762297fa8cf5" -> null
      - force_destroy      = false -> null
      - id                 = "swagger-ui-es-bundle-core.js" -> null
      - key                = "swagger-ui-es-bundle-core.js" -> null
      - source             = "swagger-ui-dist/swagger-ui-es-bundle-core.js" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["README.md"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "b4db97646e947691772eace4c7735928" -> null
      - force_destroy      = false -> null
      - id                 = "README.md" -> null
      - key                = "README.md" -> null
      - source             = "swagger-ui-dist/README.md" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_s3_object.swagger_dist["package.json"] has been deleted
  - resource "aws_s3_object" "swagger_dist" {
      - acl                = "private" -> null
      - bucket             = "xgr00q-dev-api-swagger" -> null
      - bucket_key_enabled = false -> null
      - content_type       = "binary/octet-stream" -> null
      - etag               = "5f267c2709d8898b6d8000170fcf3420" -> null
      - force_destroy      = false -> null
      - id                 = "package.json" -> null
      - key                = "package.json" -> null
      - source             = "swagger-ui-dist/package.json" -> null
      - storage_class      = "STANDARD" -> null
      - tags_all           = {} -> null
    }
  # aws_api_gateway_integration.openapi_swagger_assets has been deleted
  - resource "aws_api_gateway_integration" "openapi_swagger_assets" {
      - cache_namespace         = "a3pb6h" -> null
      - connection_type         = "INTERNET" -> null
      - credentials             = "arn:aws:iam::220881534007:role/ApiGatewayAmazonS3AccessRole" -> null
      - http_method             = "GET" -> null
      - id                      = "agi-gcp9dahm4c-a3pb6h-GET" -> null
      - integration_http_method = "GET" -> null
      - passthrough_behavior    = "WHEN_NO_MATCH" -> null
      - request_parameters      = {
          - "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          - "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
          - "integration.request.path.asset"                 = "method.request.path.asset"
        } -> null
      - resource_id             = "a3pb6h" -> null
      - rest_api_id             = "gcp9dahm4c" -> null
      - timeout_milliseconds    = 29000 -> null
      - type                    = "AWS" -> null
      - uri                     = "arn:aws:apigateway:ca-central-1:s3:path/xgr00q-dev-api-swagger/{asset}" -> null
    }
  # aws_api_gateway_integration_response.openapi_swagger has been deleted
  - resource "aws_api_gateway_integration_response" "openapi_swagger" {
      - http_method         = "GET" -> null
      - id                  = "agir-gcp9dahm4c-ja8avr-GET-200" -> null
      - resource_id         = "ja8avr" -> null
      - response_parameters = {
          - "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          - "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        } -> null
      - rest_api_id         = "gcp9dahm4c" -> null
      - status_code         = "200" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_lambda_invocation.db will be read during apply
  # (config refers to values not yet known)
 <= data "aws_lambda_invocation" "db"  {
      ~ id            = "lambda-db_$LATEST_5b76b0eef9af8a2300673e0553f609f9" -> (known after apply)
      - qualifier     = "$LATEST" -> null
      ~ result        = jsonencode(
            {
              - body       = {
                  - logs    = []
                  - success = true
                }
              - headers    = {
                  - time = "2022-08-24T19:54:45.553Z"
                }
              - statusCode = 200
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_deployment.this must be replaced
+/- resource "aws_api_gateway_deployment" "this" {
      ~ created_date  = "2022-08-24T19:54:29Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:220881534007:gcp9dahm4c/test" -> (known after apply)
      ~ id            = "uwe96d" -> (known after apply)
      ~ invoke_url    = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "c20788a66edd1da6e2c24796c7442d2154284b7b"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # aws_api_gateway_integration.openapi_swagger will be created
  + resource "aws_api_gateway_integration" "openapi_swagger" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = "arn:aws:iam::220881534007:role/ApiGatewayAmazonS3AccessRole"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:ca-central-1:s3:path/xgr00q-dev-api-swagger/index.html"
    }

  # aws_api_gateway_integration.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration" "openapi_swagger_assets" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + credentials             = "arn:aws:iam::220881534007:role/ApiGatewayAmazonS3AccessRole"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "GET"
      + passthrough_behavior    = (known after apply)
      + request_parameters      = {
          + "integration.request.header.Content-Disposition" = "method.request.header.Content-Disposition"
          + "integration.request.header.Content-Type"        = "method.request.header.Content-Type"
          + "integration.request.path.asset"                 = "method.request.path.asset"
        }
      + resource_id             = (known after apply)
      + rest_api_id             = "gcp9dahm4c"
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = "arn:aws:apigateway:ca-central-1:s3:path/xgr00q-dev-api-swagger/{asset}"
    }

  # aws_api_gateway_integration_response.openapi_swagger will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_integration_response.openapi_swagger_assets will be created
  + resource "aws_api_gateway_integration_response" "openapi_swagger_assets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = "integration.response.header.Content-Disposition"
          + "method.response.header.Content-Type"        = "integration.response.header.Content-Type"
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_method.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_method" "openapi_swagger_proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Content-Disposition" = true
          + "method.request.header.Content-Type"        = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gcp9dahm4c"
    }

  # aws_api_gateway_method.swagger_assets_proxy will be created
  + resource "aws_api_gateway_method" "swagger_assets_proxy" {
      + api_key_required   = false
      + authorization      = "NONE"
      + http_method        = "GET"
      + id                 = (known after apply)
      + request_parameters = {
          + "method.request.header.Content-Disposition" = true
          + "method.request.header.Content-Type"        = true
          + "method.request.path.asset"                 = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = "gcp9dahm4c"
    }

  # aws_api_gateway_method_response.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_method_response" "openapi_swagger_proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = true
          + "method.response.header.Content-Type"        = true
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_method_response.swagger_assets_proxy will be created
  + resource "aws_api_gateway_method_response" "swagger_assets_proxy" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Content-Disposition" = true
          + "method.response.header.Content-Type"        = true
        }
      + rest_api_id         = "gcp9dahm4c"
      + status_code         = "200"
    }

  # aws_api_gateway_resource.openapi_swagger will be created
  + resource "aws_api_gateway_resource" "openapi_swagger" {
      + id          = (known after apply)
      + parent_id   = "irntllxe14"
      + path        = (known after apply)
      + path_part   = "openapi"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.openapi_swagger_proxy will be created
  + resource "aws_api_gateway_resource" "openapi_swagger_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "swagger"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_api_gateway_resource.swagger_assets_proxy will be created
  + resource "aws_api_gateway_resource" "swagger_assets_proxy" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{asset}"
      + rest_api_id = "gcp9dahm4c"
    }

  # aws_iam_role_policy.s3_read_access_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "s3_read_access_policy" {
        id     = "ApiGatewayAmazonS3AccessRole:AWSS3ResourceReadAccessRolePolicy"
        name   = "AWSS3ResourceReadAccessRolePolicy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:Get*",
                          - "s3:List*",
                          - "s3-object-lambda:Get*",
                          - "s3-object-lambda:List*",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::xgr00q-dev-api-swagger/*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_lambda_function.actions will be updated in-place
  ~ resource "aws_lambda_function" "actions" {
        id                             = "lambda-actions"
      ~ last_modified                  = "2022-08-24T19:54:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "wjAWIg8tWI+lC2aDd0gUHxbzLX+DKx9LNLUHQ3qq20Y=" -> "bakqS0y2CWSPrrrdijfWy3lqkgNU5g7PJNEjQDDYwaw="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.app will be updated in-place
  ~ resource "aws_lambda_function" "app" {
        id                             = "lambda-app"
      ~ last_modified                  = "2022-08-24T19:54:43.000+0000" -> (known after apply)
      ~ source_code_hash               = "hJE6vqM71HvbMkbKDUh5jwseuWdEYFdNDwITofLRx0c=" -> "Q2HAfoeFvjVVD3550Vt6FDq7ktQjY7kKro12g1MmOmU="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.css_api will be updated in-place
  ~ resource "aws_lambda_function" "css_api" {
        id                             = "lambda-css-api"
      ~ last_modified                  = "2022-08-24T19:54:49.000+0000" -> (known after apply)
      ~ source_code_hash               = "JpI49AdDsuh9Un0MKDB8xlVvEW1w+s9ikDP9Phh4Hs8=" -> "FzLkV5aU4nN33Aj2/DjoUSALmfNraTcVuqKxOkvPI84="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.db will be updated in-place
  ~ resource "aws_lambda_function" "db" {
        id                             = "lambda-db"
      ~ last_modified                  = "2022-08-24T19:54:38.000+0000" -> (known after apply)
      ~ source_code_hash               = "OX3ojluWO5sNbbY1KbM64/SA31WubumfV2OAzdKUwhc=" -> "A0cjLMKHz9Ds9NnyvZdhWT4vBgsDFKajxYRiRX7svFs="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_lambda_function.scheduler will be updated in-place
  ~ resource "aws_lambda_function" "scheduler" {
        id                             = "lambda-scheduler"
      ~ last_modified                  = "2022-08-24T19:54:27.000+0000" -> (known after apply)
      ~ source_code_hash               = "DSaI+6cLzRqT2SnHL7HrS3nTJHIFGv0vW1awGaKsaIk=" -> "xG9Ax6m0lpG4F+Q4dT7+tnJnt0g0sv74MZezbV68DDA="
        tags                           = {
            "managed-by" = "terraform"
        }
        # (24 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_s3_object.swagger_dist["README.md"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "b4db97646e947691772eace4c7735928"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "README.md"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/README.md"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["absolute-path.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "7ca5ebff3b35e49ef75f96885c6ed7c2"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "absolute-path.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/absolute-path.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["favicon-16x16.png"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "f0ae831196d55d8f4115b6c5e8ec5384"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-16x16.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/favicon-16x16.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["favicon-32x32.png"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "image/png"
      + etag                   = "40d4f2c38d1cd854ad463f16373cbcb6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "favicon-32x32.png"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/favicon-32x32.png"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["index.css"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "54fdd628e48969ad325a0b370af12f53"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/index.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["index.html"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "c435050a755f3ba71a4df97e599b71c9"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/index.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["index.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "4843f77ccf9e12e7e60efa279baaffb3"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "index.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/index.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["oauth2-redirect.html"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/html"
      + etag                   = "3ab4f43d18d78a61dde617b747479e96"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "oauth2-redirect.html"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/oauth2-redirect.html"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["package.json"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "5f267c2709d8898b6d8000170fcf3420"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "package.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/package.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-initializer.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "1e0aac5572865132f120e6675d27dae0"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-initializer.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-initializer.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-output.json"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/json"
      + etag                   = "d10a662b954f461bac391dc4bf18b5ad"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-output.json"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-output.json"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-bundle.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "e0ae76d9795806abae1f7781d89d4f4b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-bundle.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-bundle.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-bundle.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "b549c47d456f47d5c1cc21fb245266a6"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-bundle.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-bundle.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "0bdf99b84564bfe12569762297fa8cf5"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle-core.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle-core.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle-core.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "4ed1de27405e80c1120ff81e2f3db61b"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle-core.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle-core.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "283ed240f92b4b56d8482b5f1e519274"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-es-bundle.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "6405e42f91756697fa77db303cbaddef"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-es-bundle.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-es-bundle.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "8e0e2470d0530680f6f16c7817337891"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-standalone-preset.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-standalone-preset.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui-standalone-preset.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "c0fb1a3c06697d061e9caeb5a6fab66c"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui-standalone-preset.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui-standalone-preset.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.css"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "text/css"
      + etag                   = "d6de32fafed0ea75ef760baa8ebe2bda"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.css"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.css"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.css.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "51d42b332ad7cdcf5fbb5820308e54db"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.css.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.css.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.js"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "application/javascript"
      + etag                   = "35392619ad8e01c979705c4506f0af86"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.swagger_dist["swagger-ui.js.map"] will be created
  + resource "aws_s3_object" "swagger_dist" {
      + acl                    = "private"
      + bucket                 = (known after apply)
      + bucket_key_enabled     = (known after apply)
      + content_type           = "binary/octet-stream"
      + etag                   = "08b9c55fb78edc1945a01a79b053d8ee"
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "swagger-ui.js.map"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "swagger-ui-dist/swagger-ui.js.map"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # module.s3_sso_api_swagger.aws_s3_bucket.this will be created
  + resource "aws_s3_bucket" "this" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "xgr00q-dev-api-swagger"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      + server_side_encryption_configuration {
          + rule {
              + bucket_key_enabled = (known after apply)

              + apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  + sse_algorithm     = (known after apply)
                }
            }
        }

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3_sso_api_swagger.aws_s3_bucket_acl.this will be created
  + resource "aws_s3_bucket_acl" "this" {
      + acl    = "private"
      + bucket = "xgr00q-dev-api-swagger"
      + id     = (known after apply)

      + access_control_policy {
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          + owner {
              + display_name = (known after apply)
              + id           = (known after apply)
            }
        }
    }

  # module.s3_sso_api_swagger.aws_s3_bucket_cors_configuration.this will be created
  + resource "aws_s3_bucket_cors_configuration" "this" {
      + bucket = "xgr00q-dev-api-swagger"
      + id     = (known after apply)

      + cors_rule {
          + allowed_headers = [
              + "*",
            ]
          + allowed_methods = [
              + "PUT",
            ]
          + allowed_origins = [
              + "*",
            ]
          + expose_headers  = [
              + "ETag",
            ]
          + max_age_seconds = 3000
        }
    }

  # module.s3_sso_api_swagger.aws_s3_bucket_public_access_block.this will be created
  + resource "aws_s3_bucket_public_access_block" "this" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + restrict_public_buckets = true
    }

Plan: 39 to add, 6 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url     = "https://gcp9dahm4c.execute-api.ca-central-1.amazonaws.com/test" -> (known after apply)
  ~ result_entry = {
      - body       = {
          - logs    = []
          - success = true
        }
      - headers    = {
          - time = "2022-08-24T19:54:45.553Z"
        }
      - statusCode = 200
    } -> (known after apply)

------------------------------------------------------------------------

Cost estimation:

Resources: 1 of 35 estimated
           $89.28/mo +$0.0
```

</details>

*Pusher: @NithinKuruba, Action: `pull_request`*